# Week 4 - Data organising with Pandas

Author: Johanne Sejrskild  
Date: 22.09.2025

# Code made by Rune Trust

*Good afternoon*  
Today we are going to work with loops, condions and using ´pandas´to manipulate data. The green excercises will be highly linked to what you livecoded with Anna. If you find them challenging use yesterdays work as a help or ask. If you want to challenge yourself, try and do them all without using any help. 
In the yellow  excercises we will do some data manipulation challenges using pandas. And we will skip the red tasks today as we have a lot on the program

**Structure of the notebook:**  
<span style="color:green">
Green excercises 
</span>
<ul>
  <li> Data wrangling on the iris dataset</li>
</ul>

<span style="color:yellow">
Yellow excercises
</span>
<ul>
  <li>Music sales challenge</li>
  <li>Space mission challenge</li>
  <li>Supervillan challenge</li>
</ul>
 

Start with the first excercise, and then continue in order. Feel free to work together, and see how far you can get.   
The important thing is to learn, not to solve all the challenges!
________________________________________________________________________________________

In [ ]:
# Before we start we need to import the necessary packages
%pip install pandas
%pip install lxml
%pip install scikit-learn

import pandas as pd
import requests # We might need this package to get some data from the web
from sklearn import datasets

<span style="color:green">
<h2>
Green excercises </h2>
</span>

## Data organisation using a dataset about flowers

In [4]:
flower = datasets.load_iris()

# convert to DataFrame
df = pd.DataFrame(flower.data, columns=flower.feature_names)

df.head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2


**Lets take a look at the data frame**

In [5]:
# There are some commands in the library pandas that can give you a quick overview of the data :)

df.head()      # first 5 rows, if you put a number into the paranthesis you can decide how many rows
df.tail()      # last 5 rows
df.info()      # summary of columns and types
df.describe()  # quick statistics (for numbers)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   sepal length (cm)  150 non-null    float64
 1   sepal width (cm)   150 non-null    float64
 2   petal length (cm)  150 non-null    float64
 3   petal width (cm)   150 non-null    float64
dtypes: float64(4)
memory usage: 4.8 KB

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
count,150.000000,150.000000,150.000000,150.000000
mean,5.843333,3.057333,3.758000,1.199333
std,0.828066,0.435866,1.765298,0.762238
min,4.300000,2.000000,1.000000,0.100000
25%,5.100000,2.800000,1.600000,0.300000
50%,5.800000,3.000000,4.350000,1.300000
75%,6.400000,3.300000,5.100000,1.800000
max,7.900000,4.400000,6.900000,2.500000

**Selecting columns and rows**

Try to run the cell below and figure out which output is linked to the code

In [6]:
# If you want to select a specific column you can select it using the name:
print(df['sepal length (cm)'].head())

# If you would like to print one row, you can use the index of the row:
print(df.iloc[0])

# if you want to select a few rows of only a few columns you can also use indexing:
print(df.iloc[0:3 , 0:2])  # first three rows, first two columns

# And if you want to select specific data, you can specify a single row and column:
print(df.iloc[2,0])  # second row, first column

# Or use the column name:
print(df.loc[2, "sepal length (cm)"]  )

0    5.1
1    4.9
2    4.7
3    4.6
4    5.0
Name: sepal length (cm), dtype: float64
sepal length (cm)    5.1
sepal width (cm)     3.5
petal length (cm)    1.4
petal width (cm)     0.2
Name: 0, dtype: float64
   sepal length (cm)  sepal width (cm)
0                5.1               3.5
1                4.9               3.0
2                4.7               3.2
4.7
4.7

**Subsetting data**   
Subsetting is the process of retrieving just the parts of large files which are of interest for a specific purpose.   
This will come in handy for your projects when you have to work with potentially large data files

In [7]:
# Let's try to select some data using conditionals

# Here we select all rows where the sepal length is larger than or equal to 5 cm
lengt_above_five = df[df["sepal length (cm)"] >= 5]   
lengt_above_five.head()

    sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                 5.1               3.5                1.4               0.2
4                 5.0               3.6                1.4               0.2
5                 5.4               3.9                1.7               0.4
7                 5.0               3.4                1.5               0.2
10                5.4               3.7                1.5               0.2

In [8]:
# Here we select all rows where the sepal length is larger than or equal to 5 cm and the sepal width is less than 2,5 cm
length_and_width = df[(df["sepal length (cm)"] >= 5) & (df["sepal width (cm)"] < 3.5)]
length_and_width.head()

    sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
7                 5.0               3.4                1.5               0.2
20                5.4               3.4                1.7               0.2
23                5.1               3.3                1.7               0.5
25                5.0               3.0                1.6               0.2
26                5.0               3.4                1.6               0.4

In [24]:
# Excercise - Find the longest petal length and the median petal length
# and subset the flowers that are between the median and one centimeter shorter than max length
largest = df["petal length (cm)"].max()
med = df["petal length (cm)"].median()

upperbound = largest-1
lowerbound = med

subset1 = df[(df["petal length (cm)"] >= lowerbound) & (df["petal length (cm)"] <= upperbound)]

**Sorting data**  
We can choose to sort our data in order of something of interest.

In [25]:
# we could sort the data by a specific column in both ascending and descending order
df_sorted = df.sort_values(by="sepal length (cm)", ascending=False) # change direction by True/False so if you want ascending order set it to True
df_sorted.head()

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
131                7.9               3.8                6.4               2.0
122                7.7               2.8                6.7               2.0
118                7.7               2.6                6.9               2.3
117                7.7               3.8                6.7               2.2
135                7.7               3.0                6.1               2.3

In [ ]:
# Excercise - sort the data by petal width in ascending order and select the 10 flowers with the smallest petal width
df_sorted2 = df.sort_values(by="petal width (cm)", ascending=True)

first_10_values = df_sorted2.head(10)
print(first_10_values)

    sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
12                4.8               3.0                1.4               0.1
13                4.3               3.0                1.1               0.1
9                 4.9               3.1                1.5               0.1
32                5.2               4.1                1.5               0.1
37                4.9               3.6                1.4               0.1
1                 4.9               3.0                1.4               0.2
4                 5.0               3.6                1.4               0.2
0                 5.1               3.5                1.4               0.2
11                4.8               3.4                1.6               0.2
10                5.4               3.7                1.5               0.2

**Flipping**  
Should you work with time seires data and would like to mirror (flip) your data, you can do this using pandas

In [34]:
print(df.head(5))

reversed_df = df.iloc[::-1]   # Flipping the dataframe horisontally (reverse rows)

print(reversed_df.head(5))

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2
     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
149                5.9               3.0                5.1               1.8
148                6.2               3.4                5.4               2.3
147                6.5               3.0                5.2               2.0
146                6.3               2.5                5.0               1.9
145                6.7               3.0                5.2               2.3

**Joining**
Sometimes we have multiple dataframes we woudl like to add together. Maybe you have been subsetting parts of an old dataframe to substract important information and would now like join them so you can begin your analysis.

In [ ]:
# Joining a bit of the iris data with a new dataframe (we will make up some data here)
first_10 = df.iloc[0:10, :]  # selecting the first 10 rows of the iris data
new_data = {"color": ["red", "blue", "green", "yellow", "purple", "red", "blue", "green", "yellow", "purple"],
            "height": [80, 80, 70, 100, 90, 80, 80, 70, 100, 90]}
# Right now new_df is a dictionary, we need to convert it to a dataframe
new_df = pd.DataFrame(new_data)

#Now we join the two dataframes
joined = first_10.join(new_df, how='left') # There are 4 different types of how: outer, inner, left, right. 

joined

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),color,height
0,5.1,3.5,1.4,0.2,red,80
1,4.9,3.0,1.4,0.2,blue,80
2,4.7,3.2,1.3,0.2,green,70
3,4.6,3.1,1.5,0.2,yellow,100
4,5.0,3.6,1.4,0.2,purple,90
5,5.4,3.9,1.7,0.4,red,80
6,4.6,3.4,1.4,0.3,blue,80
7,5.0,3.4,1.5,0.2,green,70
8,4.4,2.9,1.4,0.2,yellow,100
9,4.9,3.1,1.5,0.1,purple,90

*Different types of how to join two data frames*  
This is important if your dataframes do not have the same amount of rows

left → all rows from the left DataFrame (default).

right → all rows from the right DataFrame.

inner → only rows with matching index values in both.

outer → all rows from both, fill missing with NaN.

In [ ]:
# Excercise - Which types of join (the 'how=') will work in the example above? Try them out and see what happens

joined = first_10.join(new_df, how='left')
joined_right = first_10.join(new_df, how='right')
joined_inner = first_10.join(new_df, how='inner')
joined_outer = first_10.join(new_df, how='outer')
#joined
#joined_right
#joined_inner
#joined_outer
# THey all work the same in this case because the rows match exactly

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),color,height
0,5.1,3.5,1.4,0.2,red,80
1,4.9,3.0,1.4,0.2,blue,80
2,4.7,3.2,1.3,0.2,green,70
3,4.6,3.1,1.5,0.2,yellow,100
4,5.0,3.6,1.4,0.2,purple,90
5,5.4,3.9,1.7,0.4,red,80
6,4.6,3.4,1.4,0.3,blue,80
7,5.0,3.4,1.5,0.2,green,70
8,4.4,2.9,1.4,0.2,yellow,100
9,4.9,3.1,1.5,0.1,purple,90

In [55]:
# Excercise 2 - Add a row to one of the dataframes and see what happens when you join them again
crazy_row = {"color": "pink", "height": "900"}

new_df = new_df._append(crazy_row, ignore_index = True)
joined = first_10.join(new_df, how='outer')
joined

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),color,height
0,5.1,3.5,1.4,0.2,red,80
1,4.9,3.0,1.4,0.2,blue,80
2,4.7,3.2,1.3,0.2,green,70
3,4.6,3.1,1.5,0.2,yellow,100
4,5.0,3.6,1.4,0.2,purple,90
5,5.4,3.9,1.7,0.4,red,80
6,4.6,3.4,1.4,0.3,blue,80
7,5.0,3.4,1.5,0.2,green,70
8,4.4,2.9,1.4,0.2,yellow,100
9,4.9,3.1,1.5,0.1,purple,90
10,NaN,NaN,NaN,NaN,red,900
11,NaN,NaN,NaN,NaN,red,900
12,NaN,NaN,NaN,NaN,pink,900
13,NaN,NaN,NaN,NaN,pink,900
14,NaN,NaN,NaN,NaN,pink,900
15,NaN,NaN,NaN,NaN,pink,900

**Concatenating**  
You can also join two dataframes bu simply gluing them together.

In [56]:
# We just made a subset of the original dataframe called 'first_10' now we find the last 10 and glue them together
last_10 = df.iloc[-10:, :]   # selecting the last 10 rows using one of the methods we learned above


# Now we concatenate the two dataframes together 
concatenated = pd.concat( [first_10, last_10], axis=0)  # axis=0 means we concatenate rows, axis=1 would concatenate columns
concatenated

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
5                  5.4               3.9                1.7               0.4
6                  4.6               3.4                1.4               0.3
7                  5.0               3.4                1.5               0.2
8                  4.4               2.9                1.4               0.2
9                  4.9               3.1                1.5               0.1
140                6.7               3.1                5.6               2.4
141                6.9               3.1                5.1               2.3
142                5.8               2.7                5.1               1.9
143                6.8               3.2                5.9               2.3
144                6.7               3.3                5.7               2.5
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

Now you have played around with some of the basics manipulation in pandas! Now lets jump into some challenges

<span style="color:yellow">
<h2>
Yellow excercises 
</span>

**OBS:**  To ensure you can go back in 3 months time and read you code and understand the logics behind it it needs to be well commented.   
So, while you solve the yellow excercises ensure that you add some meaningful comments about the logics and coding choices.  

:))


*The Yellow excercises is borrowed from last years couse and written by Ethan Weed*

**Music sales challenge**

Write a script that:

1. Combines the tables of best-selling physical singles and best-selling digital singles on the Wikipedia page "List_of_best-selling_singles"
2. Outputs the artist and single name for the year you were born. If there is no entry for that year, take the closest year after you were born.
3. Outputs the artist and single name for the year you were 15 years old.

In [57]:
# Starter code
#musicdata = pd.read_html("https://en.wikipedia.org/wiki/List_of_best-selling_singles")
url_music = "https://en.wikipedia.org/wiki/List_of_best-selling_singles"

# Add a User-Agent header so Wikipedia doesn't block it
headers = {"User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64)"}
response = requests.get(url_music, headers=headers)

# Pass the HTML text to pandas
musicdata = pd.read_html(response.text)


#Extracting physical and digital singles from the musicdata
physical_singles = musicdata[0]
digital_singles = musicdata[3]

physical_singles['Type'] = 'Physical'
digital_singles['Type'] = 'Digital'

# Combining the two tables
combined_singles = pd.concat([physical_singles, digital_singles])
combined_singles.head()

/tmp/ipykernel_354/1297234199.py:10: FutureWarning: Passing literal html to 'read_html' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  musicdata = pd.read_html(response.text)

,Artist,Single,Released,Sales (in millions),Source,Type
0,Bing Crosby,"""White Christmas""",1942,50,[1],Physical
1,Elton John,"""Something About the Way You Look Tonight""/""Ca...",1997,33,[1],Physical
2,Bing Crosby,"""Silent Night""",1935,30,[2],Physical
3,Tino Rossi,"""Petit Papa Noël""",1946,30,[3],Physical
4,Bill Haley & His Comets,"""Rock Around the Clock""",1954,25,[4][5],Physical

In [67]:
# Print the arrtist and single from the year you were 15 years old. 
singles_2016 = combined_singles[combined_singles["Released"] == 2016]

print(singles_2016)

                               Artist       Single  Released  \
3             Rihanna featuring Drake       "Work"      2016
7   The Chainsmokers featuring Halsey     "Closer"      2016
18                            Rihanna  "Needed Me"      2016

   Sales (in millions)    Source     Type
3              32.5[a]      [52]  Digital
7              20.7[a]  [54][50]  Digital
18               17[a]      [52]  Digital

## Space challenge

1. Make a single dataframe that combines the space missions from the 1950's to the 2020's
2. Write a script that returns the year with the most launches
3. Write a script that returns the most common month for launches
4. Write a script that ranks the months from most launches to fewest launches

In [11]:
import datetime as dt

In [14]:
# Starter code.
url_space =  "https://en.wikipedia.org/wiki/Timeline_of_Solar_System_exploration"

# Add a User-Agent header so Wikipedia doesn't block it
headers = {"User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64)"}
response = requests.get(url_space, headers=headers)

# Pass the HTML text to pandas
spacedata = pd.read_html(response.text)

# combine all tables into data frame
combined_space = pd.concat(spacedata, ignore_index = True)

# Dropping column we dont need
combined_space = combined_space.iloc[:, 0:3]
combined_space.head()

/tmp/ipykernel_1514/4030390085.py:9: FutureWarning: Passing literal html to 'read_html' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  spacedata = pd.read_html(response.text)

,Mission name,Launch date,Description
0,Sputnik 1,4 October 1957,First Earth orbiter
1,Sputnik 2,3 November 1957,"Earth orbiter, first animal in orbit, a dog na..."
2,Explorer 1,1 February 1958,Earth orbiter; discovered Van Allen radiation ...
3,Vanguard 1,17 March 1958,Earth orbiter; oldest spacecraft still in Eart...
4,Luna 1,2 January 1959,First lunar flyby (attempted lunar impact?); f...

In [17]:
combined_space.columns = ["Mission", "Date", "Details"]
combined_space.head()

,Mission,Date,Details
0,Sputnik 1,4 October 1957,First Earth orbiter
1,Sputnik 2,3 November 1957,"Earth orbiter, first animal in orbit, a dog na..."
2,Explorer 1,1 February 1958,Earth orbiter; discovered Van Allen radiation ...
3,Vanguard 1,17 March 1958,Earth orbiter; oldest spacecraft still in Eart...
4,Luna 1,2 January 1959,First lunar flyby (attempted lunar impact?); f...

In [ ]:
## The year with the most launches 
# Making the date column into datetime objects
combined_space["Date"] = pd.to_datetime(
    combined_space["Date"]
)

# Extracting year only from the date column
combined_space["Year"] = combined_space["Date"].dt.year

# Counting launches per year and identifying which year variable has the most launches
launches_per_year = combined_space["Year"].value_counts()
most_launches_year = launches_per_year.idxmax()
most_launches_year

# Output shows most launches in 1967

np.float64(1967.0)

In [ ]:
# The month with the most launches 
combined_space["Month"] = combined_space["Date"].dt.month

# Counting the same as above using datetime objects, only just looking at months this time
launches_per_month = combined_space["Month"].value_counts()
most_launches_month = launches_per_month.idxmax()
most_launches_month

# Output shows most launches in month 11, also known as November

np.float64(11.0)

In [ ]:
# Ranking of months with the most to the fewest launches
month_ranking = launches_per_month.sort_values(ascending=False)
month_ranking

Month
11.0    31
8.0     27
9.0     25
10.0    24
1.0     21
7.0     21
12.0    19
2.0     18
5.0     18
3.0     15
6.0     14
4.0     13
Name: count, dtype: int64

## Supervillain challenge

1. Write a script that combines the tables showing supervillain debuts from the 30's through the 2010's
2. Write a script that ranks each decade in terms of how many supervillains debuted in that decade
3. Write a script that ranks the different comics companies in terms of how many supervillains they have, and display the results in a nice table (pandas dataframe)

In [31]:
from io import StringIO

In [ ]:
url_villain = "https://en.wikipedia.org/wiki/List_of_comic_book_supervillain_debuts"

# Add a User-Agent header so Wikipedia doesn't block it
headers = {"User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64)"}
response = requests.get(url_villain, headers=headers)

# Pass the HTML text to pandas
supervillaindata = pd.read_html(StringIO(response.text))

# Error handling for non-sensical fetch from the responses package
villain_tables = []

for table in supervillaindata:
    if {"Character / Team", "Year Debuted", "Company"}.issubset(table.columns):
        villain_tables.append(table)

df_supervillain = pd.concat(villain_tables, ignore_index=True)
df_supervillain.head()

,Character / Team,Year Debuted,Company,Creator/s,First Appearance
0,Ultra-Humanite,1939 (June),DC,"Jerry Siegel, Joe Shuster",Action Comics (vol. 1) #13
1,Dr. Death,1939 (July),DC,"Bob Kane, Bill Finger",Detective Comics (vol. 1) #29
2,The Monk,1939 (September),DC,"Bob Kane, Bill Finger",Detective Comics (vol. 1) #31
3,The Claw,1939 (December),Lev Gleason Publications,Jack Cole,Silver Streak Comics #1
4,Hath-Set,1940 (January),DC,"Gardner Fox, Dennis Neville",Flash Comics #1

In [45]:
# Cleaning columns
df_supervillain = df_supervillain.rename(columns={
    "Character / Team": "Villain",
    "Year Debuted": "Year",
    "Company": "Publisher"
})

In [ ]:
# Making a year only column using a regex to exclude month
df_supervillain["Year"] = (
    df_supervillan["Year"]
    .astype(str)
    .str.extract(r"(\d{4})")
    .astype(float)
)

# Subsetting to only keep data within scope
df_supervillain = df_supervillain[
    (df_supervillain["Year"] >= 1930) &
    (df_supervillain["Year"] <= 2019)
]

In [57]:
# Decade column
df_supervillain["Decade"] = (df_supervillain["Year"] // 10) * 10

/tmp/ipykernel_1514/2563604700.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_supervillain["Decade"] = (df_supervillain["Year"] // 10) * 10

In [ ]:
# 1. Write a script that combines the tables showing supervillain debuts from the 30's through the 2010's
villains_by_decade = (
    df_supervillain
    .groupby("Decade")["Villain"]
    .apply(list)
    .reset_index()
)

villains_by_decade

# This outputs what unique villains were introduced in which decade

   Decade                                            Villain
0  1930.0    [Ultra-Humanite, Dr. Death, The Monk, The Claw]
1  1940.0  [Hath-Set, Hugo Strange, Doctor Sivana, Lex Lu...
2  1950.0  [Deadshot, The Mekon, Red Hood, Killer Moth, F...
3  1960.0  [Grottu, Starro, Amazo, Professor Ivo, Trickst...
4  1970.0  [Agatha Harkness, Arkon, Man-Bat, Lethal Legio...
5  1980.0  [Cutthroat, Destiny, Sebastian Shaw, Rainbow R...
6  1990.0  [Crimesmith, NKVDemon, Blackout (Lilin), Cybor...
7  2000.0  [Kyle Abbot, Able Crown, Agamemno, Orca, Zeiss...
8  2010.0  [Allegra Garcia, Massacre, The Maker, Court of...

In [62]:
# 2. Write a script that ranks each decade in terms of how many supervillains debuted in that decade
villains_per_decade_df = villains_per_decade.reset_index()
villains_per_decade_df.columns = ["Decade", "Number_of_Villains"]
villains_per_decade_df

   Decade  Number_of_Villains
0  1960.0                 229
1  1970.0                  97
2  1980.0                  91
3  1990.0                  85
4  2000.0                  51
5  1940.0                  47
6  1950.0                  26
7  2010.0                  14
8  1930.0                   4

In [66]:
# 3. Write a script that ranks the different comics companies in terms of how many supervillains they have, and display the results 

# Normalizing publisher names for a more representative presentation
df_supervillain["Publisher"] = (
    df_supervillain["Publisher"]
    .str.replace("Comics", "", regex=False)
    .str.strip()
)

# Counting per normalized publisher
villains_per_publisher = df_supervillan["Publisher"].value_counts()
villains_per_publisher_df = villains_per_publisher.reset_index()
villains_per_publisher_df.columns = ["Publisher", "Number_of_Villains"]
villains_per_publisher_df

/tmp/ipykernel_1514/531568689.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_supervillain["Publisher"] = (

                   Publisher  Number_of_Villains
0                         DC                 345
1                     Marvel                 270
2                 Dark Horse                   6
3          Fawcett Comics/DC                   6
4                      Image                   5
5              Marvel/Timely                   4
6            Disney/Hyperion                   4
7                   Eternity                   3
8   Lev Gleason Publications                   1
9                     Comico                   1
10                    Mirage                   1
11              Image Comics                   1